package org.example.experemental;

import java.util.List;

public class DecomposeExp2 {

    public List<String> decompose(String expression){

        //1+4*5
        // 1 + 4 * 5
        // 0   1   2
        //значения в массиве *[1,2] +[0,1]
        //приоритеты         1      2

        //1+4*5*6+1
        // 1 + 4 * 5 * 6 + 1
        // 0   1   2   3   4
        //значения в массиве *[1,2] *[1,2]
        //приоритеты         1      2      3   4   5

        //1+3*(2+(10+5))
        //значения в массиве
        //приоритеты         1    2  3   4   5

        //(20+6)*(2+5)
        //значения в массиве
        //приоритеты          1    2  3   4  5

        //(20+6)*(2+5)+(6+7)
        //значения в массиве
        //приоритеты          1    2  3   4  5   6

        //(20+6*(1+5))*(2+5)
        //значения в массиве
        //приоритеты          1     2   3   4     5

        return null;
    }

    //Алгоритм решения
    //10 + 5 | (удалить 1 и 2) & (5 (2)) | (2+, 3*, 1+) => (2+, 15, 3*, 1+)
    //2 + 15 | удалить 1 и 2 & 17 (2) | (3*, 1+) => (3*, 17, 1+)
    //3 * 17 | удалить 1 и 2 & 51 (2) | (1+) => (1+, 51)
    //1 + 51 | удалить 1 и 2 & 52 (0) | (52)
}
